# 1. Написати лямбда функцію яка приймає один або 2 аргументи (другому задати значення за замовчуванням рівне 100,
# як у звичайних функціях) та друкує символ переданий як перший аргумент ту кількість раз яка вказана в
# другому аргументі, зробити можливим роботу фнкції не тільки з рядком а й з цифрами.
b = 100
(lambda a, b: print(((str(a) + ' ') * b))) (5, b)

# 2. Написати лямбда функцію яка приймає 2 числа як аргументи та повертає більше з них (використовуйте тернарний if) NOT DONE!!
(lambda c, d: print(max(c,d))) (2,6)

result = lambda x,y : (x)\
    if x > y else (y)
print((result(2,6)))


# 3. Написати лямбда функція яка нічого не приймає та завжди повертає 10 (via print).
x = lambda : 10
print(x())
